---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.ExtrusionFailures.InvalidExtrusionCurveloopError
source: html/2ca4a730-1e20-757b-792a-6b12932075fc.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ExtrusionFailures.InvalidExtrusionCurveloopError Property

Base sketch for extrusion is invalid.

## Syntax (C#)
```csharp
public static FailureDefinitionId InvalidExtrusionCurveloopError { get; }
```